[
    {
        "title": "Has Lloyds Run Too Far After Surging 66% in 2025?",
        "summary": "Curious if Lloyds Banking Group is trading at a bargain or just keeping up with the crowd? Let’s dig into where the value case stands right now. Lloyds’ stock has soared 66.2% year-to-date and is up an eye-catching 209.9% over five years, with a recent 11.0% jump in just the last month. Much of this momentum has come on the heels of a renewed confidence in UK banking stocks, with positive market sentiment following regulatory updates and shifts in interest rate expectations, sparking fresh...",
        "description": "",
        "url": "https://finance.yahoo.com/news/lloyds-run-too-far-surging-043047781.html"
    },
    {
        "title": "Octopus EV secures £500m funding from lenders – report",
        "summary": "The company agreed the additional funding with lenders, including Lloyds Banking Group, Morgan Stanley and Crédit Agricole.",
        "description": "",
        "url": "https://www.motorfinanceonline.com/news/octopus-ev-funding/"
    },
    {
        "title": "Lloyds clinches £120m deal for digital wallet provider Curve",
        "summary": "Britain's biggest high street lender has struck a £120m deal to buy Curve, the digital wallet provider, despite recriminations from shareholders about the distribution of the sale proceeds.  Sky News has learnt Curve notified its investors this week that it had signed a share sale and purchase agreement with Lloyds Banking Group.",
        "description": "",
        "url": "https://uk.finance.yahoo.com/news/lloyds-clinches-120m-deal-digital-093300370.html"
    },
    {
        "title": "FTSE 100 down and US markets mixed amid UK budget rumours and doubts about Fed rate cut",
        "summary": "The tepid trade in the US followed Wall Street's steepest sell-off in over a month as ebbing faith in a December interest-rate cut puts pressure on riskier assets like Big Techs.",
        "description": "",
        "url": "https://uk.finance.yahoo.com/news/ftse-100-live-markets-reeves-drops-budget-plan-raise-income-tax-092225015.html"
    },
    {
        "title": "What Do Analysts Think About Lloyds Banking Group plc (LYG)?",
        "summary": "Lloyds Banking Group plc (NYSE:LYG) is one of the best cheap stocks under $10 to buy now. Lloyds Banking Group plc (NYSE:LYG) announced on November 6 the launch of UK’s first agentic AI financial assistant early in the coming year, offering “personalised, round-the-cloud financial guidance” to 21 million mobile app customers. Management reported that customers […]",
        "description": "",
        "url": "https://finance.yahoo.com/news/analysts-think-lloyds-banking-group-043721206.html"
    },
    {
        "title": "Lloyds (LYG) Plans UK’s First Multi-Feature AI-Powered Financial Assistant",
        "summary": "Lloyds Banking Group PLC (NYSE:LYG) is one of the best European bank stocks to buy now. On November 7, Lloyds Banking Group PLC (NYSE:LYG) revealed plans to unveil the UK’s first large-scale, multi-feature AI-powered financial assistant. The product will target the lender’s 21 million mobile app customers in early 2026. This assistant, the bank said, […]",
        "description": "",
        "url": "https://finance.yahoo.com/news/lloyds-lyg-plans-uk-first-042130652.html"
    },
    {
        "title": "Non-U.S. Bank Stocks Set A Blistering Industry Pace. Here's The Outlook.",
        "summary": "A group of top performing European bank stocks broke out this week. Some have returned more than 120% this year.",
        "description": "",
        "url": "https://www.investors.com/research/industry-snapshot/bank-stocks-europe-banks-tariffs-outlook/?src=A00220&yptr=yahoo"
    },
    {
        "title": "Octopus COPs £500m financing boost for electric vehicles arm",
        "summary": "The electric vehicle-leasing business which forms part of the same group as Britain's biggest household energy supplier will on Friday announce a £500m extension to its financing war chest.  Sky News has learnt that Octopus Electric Vehicles (Octopus EV) has struck a deal with lenders including Lloyds Banking Group, Morgan Stanley, and Credit Agricole to take its total funding line to £2bn.  The additional financing paves the way for the expansion of the company's UK fleet from 40,000 to 75,000 cars, and is an extension to a facility agreed with Lloyds in 2023.",
        "description": "",
        "url": "https://uk.finance.yahoo.com/news/octopus-cops-500m-financing-boost-145100644.html"
    },
    {
        "title": "HSBC and Halifax cut mortgage prices ahead of autumn budget",
        "summary": "Find out the latest mortgage rates and deals from HSBC, NatWest, Santander, Barclays and more.",
        "description": "",
        "url": "https://uk.finance.yahoo.com/news/cheapest-mortgage-interest-rates-bank-of-england-120033599.html"
    },
    {
        "title": "Best credit card deals of the week",
        "summary": "Discover the best credit cards to save money, earn rewards and travel smarter.",
        "description": "",
        "url": "https://uk.finance.yahoo.com/news/purchase-credit-card-deals-141712104.html"
    }
]